Table of Contents
 Class BeamDataEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Beam data Ec2
public class BeamDataEc2
Inheritance
object
BeamDataEc2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 BeamDataEc2()
constructor
public BeamDataEc2()
Properties
 BeamSpanLength
beam span lengrh - theoretical support distance
public double BeamSpanLength { get; set; }
Property Value
double
 CheckLimitDeflRheoEffects
true for check of limit deflection for beam span from rheological effects of variable loads
public bool CheckLimitDeflRheoEffects { get; set; }
Property Value
bool
 CheckLimitDeflection
indicator for check of limit deflection for beam span
public bool CheckLimitDeflection { get; set; }
Property Value
bool
 DeflectionSheme
type of span loads
public TypeDeflectionSheme DeflectionSheme { get; set; }
Property Value
TypeDeflectionSheme
 IsAbsValueLimitDeflection
true for absolute user value of limit deflection (both - total + rheological)
public bool IsAbsValueLimitDeflection { get; set; }
Property Value
bool
 IsUserLimitDeflection
true for user value of limit deflection (both - total + rheological)
public bool IsUserLimitDeflection { get; set; }
Property Value
bool
 IsYDirectionData
true for deflection data in Y direction
public bool IsYDirectionData { get; set; }
Property Value
bool
 Ln
Length of beam
public double Ln { get; set; }
Property Value
double
 RequiredCamber
required camber
public double RequiredCamber { get; set; }
Property Value
double
 TypeOfCalculation
there are several types of calculation
public TypeOfCalculationDeflection TypeOfCalculation { get; set; }
Property Value
TypeOfCalculationDeflection
 TypeOfSupportLeft
Type of support on the left side
public TypeOfSupportConditions TypeOfSupportLeft { get; set; }
Property Value
TypeOfSupportConditions
 TypeOfSupportRight
Type of support on the right side
public TypeOfSupportConditions TypeOfSupportRight { get; set; }
Property Value
TypeOfSupportConditions
 UserLimitDeflRheoEffects
user value of limit deflection from rheological effects of variable loads - denominator - 1 / value
public double UserLimitDeflRheoEffects { get; set; }
Property Value
double
 UserLimitDeflection
user value of limit deflection - denominator - 1 / value
public double UserLimitDeflection { get; set; }
Property Value
double
 WidthOfSupportLeft
Width of support on the left side
public double WidthOfSupportLeft { get; set; }
Property Value
double
 WidthOfSupportRight
Width of support on the right side
public double WidthOfSupportRight { get; set; }
Property Value
double
 Edit this page